tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "mistertea/et"
brew "bat"
brew "cfn-lint"
brew "csvkit"
brew "ctags"
brew "fish"
brew "git"
brew "jq"
brew "lsd"
brew "mosh"
brew "neovim", args: ["HEAD"]
brew "node"
brew "node-build"
brew "pyenv"
brew "qemu"
brew "ruby-build"
brew "rbenv"
brew "reattach-to-user-namespace"
brew "ripgrep"
brew "rsync"
brew "tmux"
brew "tree"
brew "up"
brew "yarn"
brew "mistertea/et/et"
cask "1password"
cask "alfred"
cask "arq"
cask "bettertouchtool"
cask "corretto"
cask "corretto8"
cask "dash"
cask "fantastical"
cask "font-fira-code"
cask "hammerspoon"
cask "intellij-idea-ce"
cask "istat-menus"
cask "iterm2"
cask "kaleidoscope"
cask "karabiner-elements"
cask "rescuetime"
cask "rocket"
cask "sequel-pro"
cask "sourcetree"
cask "suspicious-package"
cask "telegram"
cask "vmware-fusion"
