# frozen_string_literal: true

tap 'autozimu/formulas'
tap 'homebrew/bundle'
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/core'
tap 'mistertea/et'
tap 'robotsandpencils/made'

brew 'aria2'
brew 'python@3.10'
brew 'awscli'
brew 'bat'
brew 'python@3.9'
brew 'cfn-lint'
brew 'cloc'
brew 'csvkit'
brew 'ctags'
brew 'diff-so-fancy'
brew 'exiftool'
brew 'fd'
brew 'harfbuzz'
brew 'ffmpeg'
brew 'fish'
brew 'git'
brew 'git-delta'
brew 'git-lfs'
brew 'gnu-tar'
brew 'htop'
brew 'httpie'
brew 'jq'
brew 'neovim'
brew 'ninja'
brew 'nmap'
brew 'node'
brew 'node-build'
brew 'node@10'
brew 'node@12'
brew 'node@14'
brew 'nodenv'
brew 'packer'
brew 'pstree'
brew 'pyenv'
brew 'python@3.8'
brew 'ruby-build'
brew 'rbenv'
brew 'reattach-to-user-namespace'
brew 'ripgrep'
brew 'rsync'
brew 'sccache'
brew 'tmux'
brew 'tree'
brew 'unar'
brew 'unison'
brew 'up'
brew 'wget'
brew 'xcbeautify'
brew 'yarn'
brew 'autozimu/formulas/unison-fsmonitor'
brew 'mistertea/et/et'
brew 'robotsandpencils/made/xcodes'

cask 'alfred'
cask 'arq'
cask 'bettertouchtool'
cask 'corretto'
cask 'corretto8'
cask 'daisydisk'
cask 'dash'
cask 'docker'
cask 'fantastical'
cask 'finicky'
cask 'font-fira-code'
cask 'google-chrome'
cask 'hammerspoon'
cask 'intellij-idea-ce'
cask 'istat-menus'
cask 'iterm2'
cask 'kaleidoscope'
cask 'karabiner-elements'
cask 'monitorcontrol'
cask 'provisionql'
cask 'quip'
cask 'rescuetime'
cask 'rocket'
cask 'sequel-pro'
cask 'slack'
cask 'sourcetree'
cask 'spotify'
cask 'suspicious-package'
cask 'vanilla'
cask 'vimr'
