# frozen_string_literal: true

tap 'autozimu/formulas'
tap 'homebrew/bundle'
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/core'
tap 'mistertea/et'

brew 'awscli'
brew 'bat'
brew 'carthage'
brew 'cfn-lint'
brew 'csvkit'
brew 'ctags'
brew 'diff-so-fancy'
brew 'fd'
brew 'fish'
brew 'git'
brew 'gnu-tar'
brew 'httpie'
brew 'jq'
brew 'neovim'
brew 'node'
brew 'node-build'
brew 'nodenv'
brew 'pstree'
brew 'pyenv'
brew 'ruby-build', args: ['HEAD']
brew 'rbenv'
brew 'reattach-to-user-namespace'
brew 'ripgrep'
brew 'rsync'
brew 'tree'
brew 'unar'
brew 'unison'
brew 'up'
brew 'wget'
brew 'autozimu/formulas/unison-fsmonitor'
brew 'mistertea/et/et'

cask '1password'
cask 'alfred'
cask 'arq'
cask 'bettertouchtool'
cask 'corretto'
cask 'corretto8'
cask 'dash'
cask 'docker'
cask 'fantastical'
cask 'font-fira-code'
cask 'google-chrome'
cask 'hammerspoon'
cask 'intellij-idea-ce'
cask 'istat-menus'
cask 'iterm2'
cask 'kaleidoscope'
cask 'karabiner-elements'
cask 'quip'
cask 'rescuetime'
cask 'rocket'
cask 'sequel-pro'
cask 'sourcetree'
cask 'suspicious-package'
cask 'telegram'
cask 'vimr'
cask 'vmware-fusion'
